--============================== Data =====================================
begin;

insert into public.movies (nm, prod_year, director)
values
	 ('Брат', 1973, 'Рязанов')
	,('Брат2', 2004, 'Михалков')
	,('Остров', 2008, 'Смит')
	,('Матрица', 2004, 'Михалков')
	,('Матрица2', 2008, 'Иванов')
	,('Матрица3', 2006, 'Петров')
	;

insert into public.tickets ("number", seat, movie)
values
	 (19, 15, 1)
	,(19, 15, 1)
	,(20, 16, 1)
	,(21, 17, 1)
	,(22, 18, 1)
	,(19, 15, 2)
	,(20, 16, 3)
	,(21, 17, 2)
	,(22, 18, 3)
;

end;